/*
Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.
[345, 897, 568, 234] -> 2
*/

int[] CreateArray(int length)
{
    int[] array = new int[length];
    for (int i = 0; i < array.Length; i++)
    {
        array[i] = new Random().Next(100, 1000);
    }
    return array;
}

int Count(int[] array)
{
    int count = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] % 2 == 0)
        {
            count++;
        }
    }
    return count;
}

void PrintArray(int[] array)
{
    Console.Write("[");
    for (int i = 0; i < array.Length; i++)
    {
        Console.Write($"{array[i]} ");
    }
    Console.Write("]");
}

Console.WriteLine("Введите размер массива: ");

int lengthUser = Convert.ToInt32(Console.ReadLine());

int[] arrayUser = CreateArray(lengthUser);
int countUser = Count(arrayUser);

Console.WriteLine($"Количество чётных чисел в массиве ");
PrintArray(arrayUser);
Console.WriteLine($" - {countUser}");
